# задание №3
print(121 % 12)
print(134 // 7)

# задание №4
print(4**7)

# задание №5 (corrected)
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(a[(len(a)//2):])

# задание №6
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(b[4:8])

# задание №7
с = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(с[-1]*10)

# задание №8
d = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(d.pop(3))

# задание №9
e = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
e.insert(5, 100)
print(e)

# задание №10
f = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
g = list(f)
print(f , g)